import random
# 問題数は21個
dict = {
    "あまおう":"ふくおか","堅パン":"ふくおか","焼肉鉄板":"ふくおか",
    "女山大根":"さが","小城羊羹":"さが","呼子のイカ":"さが",
    "対州そば":"ながさき","ちゃんぽん":"ながさき","からすみ":"ながさき",
    "菊池水田ごぼう":"くまもと","田浦銀太刀":"くまもと","八代生姜":"くまもと",
    "カボス":"おおいた","乾しいたけ":"おおいた","スッポン":"おおいた",
    "ヤマダイかんしょ":"みやざき","日向かぼちゃ":"みやざき","きんかん":"みやざき",
    "壺作り黒酢":"かごしま","辺塚だいだい":"かごしま","鰹節(かつおぶし)":"かごしま"
    }
p = 0
g = 0
while True:
    print("九州の中の名産品でどこの県か当ててみて！")
    v = list(dict)
    r = random.randint(0,len(v) - 1)
    a = list(dict.keys())
    b = list(dict.values())
    c = a[r]
    e = b[r]
    print(f"{c}の名産品が有名な県は何県でしょう?!")
    d = input()
    print("入力された県:",d)
    g += 1
    if d == e :
        print("正解です！次の問題も頑張って")
        p += 1
    elif d == "exit" or r == 0:
        g -= 1
        j = p / g * 100
        print(f"正解率は{p}%です。")
        break
    elif d == "exit":
        break
    else:
        print(f"不正解です。正解は{e}です。次の問題を頑張りましょう！")

